Repository: AppCamps/TeachingPlatform
Catalog: config/locales/frontend/*.po
Languages: de

source: If the email is registered with App Camps and not confirmed yet you will soon receive a link to confirm it.
de: Falls die angegebene E-Mail-Adresse bei uns existiert bekommst du gleich einen Link zum Bestätigen deiner E-Mail-Adresse zugeschickt.

source: Email confirmed. You may now login using your email and password.
de: Deine E-Mail-Adresse ist nun bestätigt. Du kannst dich jetzt mit deinem neuen Passwort anmelden.

source: The confirmation of your email address was not successful. Please, contact us via philipp@appcamps.de so that we can confirm your account.
de: Die Bestätigung deiner E-Mail-Adresse war nicht erfolgreich. Bitte melde dich bei philipp@appcamps.de. Dann können wir deine E-Mail Adresse freischalten.

source: Your confirmation link has expired. Please restart the confirmation process.
de: Dein Bestätigungslink ist abgelaufen. Bitte starte denn Prozess erneut.

source: If the email you provided is registered with App Camps you will soon receive an email containing a link to the reset form.
de: Falls die angegebene E-Mail-Adresse bei uns existiert bekommst du gleich einen Link zum zurücksetzen deines Passworts zugeschickt.

source: Password successfully changed. You can now login with your new password.
de: Dein Passwort wurde erfolgreich geändert. Du kannst dich jetzt mit deinem neuen Passwort anmelden.

source: There was an error with your reset link. Please restart the password recovery process.
de: Die Änderung deines Passworts war leider nicht erfolgreich. Bitte starte denn Prozess erneut.

source: Your password reset link has expired. Please restart the password recovery process.
de: Die Zeit zum Ändern deines Passworts ist abgelaufen. Bitte starte denn Prozess erneut.

source: Appcamps on {name}
de: Appcamps bei {name}

source: With {love} from {brand}
de: Mit {love} von {brand}

source: Imprint
de: Impressum

source: Privacy Policy
de: Datenschutzerklärung

source: Change address
de: Adresse ändern

source: Edit school information
de: Schuldaten ändern

source: Help
de: Hilfe

source: Platform tips
de: Tipps zur Plattform

source: Frequently asked questions
de: Häufige Fragen

source: Contact team
de: Kontakt zum Team

source: Certificates
de: Zertifikate

source: Edit user information
de: Nutzerdaten ändern

source: Edit password
de: Passwort ändern

source: Logout
de: Abmelden

source: This lesson was tagged as completed.
de: Diese Lektion wurde als erledigt makiert.

source: Undo
de: Rückgangig machen

source: Tag lesson as completed
de: Lektion als erledigt markieren

source: back to my classes
de: zur Klassenübersicht

source: Archive confirmation message
de: Möchtest Du diese Klasse wirklich archivieren?

source: You did not add any courses yet
de: Du hast noch keine Kurse hinzugefügt

source: Archive class
de: Klasse archivieren

source: Edit class
de: Klasse bearbeiten

source: Not yet started
de: Noch nicht gestartet

source: As soon as you mark the first lession as completed, you will see in the progress bar how far are you in the class.
de: Sobald du die erste Lektion als erledigt markiert hast, siehst du am Balken, wie weit du mit der Klasse bist

source: Continue course
de: Kurs fortsetzen

source: Start course
de: Kurs starten

source: Successfully concluded
de: Erfolgreich beendet!

source: Show all classes
de: Alle Klassen anzeigen

source: My classes
de: Meine Klassen

source: Add a new class
de: Neue Klasse anlegen

source: Why to add classes?
de: Warum Klassen anlegen?

source: Helpful for you:
de: Hilfreich für dich:

source: you can manage more classes and see their progress.
de: Du kannst mehrere Klassen verwalten und siehst den Fortschritt.

source: Helpful for us:
de: Hilfreich für uns:

source: through the existing classes we see how many students we could reach. When we show that we reach many students, we can keep our offer by financing ourselves via funding and providing support also in the future for free.
de: Durch angelegte Klassen erfahren wir, wie viele SchülerInnen wir erreichen. Es geht uns um die Anzahl der SchülerInnen. Namen oder persönliche Daten fragen wir nicht ab. Wenn wir zeigen, dass wir viele SchülerInnen erreichen, können wir unser Angebot über Stiftungen finanzieren und die Unterlagen auch in Zukunft kostenlos anbieten.

source: back to course overview
de: zurück zum Kursangebot

source: Course preview
de: Kursvorschau

source: You did not save your data! Do you still want to leave the page?
de: Du hast deine Angaben nicht gespeichert. Willst du die Seite trotzdem verlassen?

source: (You can save the class in the third step, please scroll down.)
de: (Die Klasse kannst du im dritten Schritt anlegen, bitte runter scrollen.)

source: Create class
de: Klasse anlegen

source: Create a new class
de: Neue Klasse anlegen

source: cancel
de: Abbrechen

source: Teaching material
de: Unterrichtsmaterial

source: News
de: Neuigkeiten

source: You did not save your changes! Do you still want to leave the page?
de: Du hast deine Änderungen nicht gespeichert. Willst du die Seite trotzdem verlassen?

source: (You can save in the third step, please scroll down.)
de: (Speichern kannst du im dritten Schritt, bitte runter scrollen.)

source: Save
de: Speichern

source: {email} is still unconfirmed. {emailConfirmationRequestLink}
de: {email} ist noch nicht bestätigt. {emailConfirmationRequestLink}

source: Resend confirmation link
de: Bestätigungslink erneut zusenden

source: Saved
de: Gespeichert

source: First name
de: Vorname

source: Last name
de: Nachname

source: Edit your data
de: Ändere deine Daten

source: Current password
de: Aktuelles Passwort

source: New password
de: Neues Passwort

source: Confirm new password
de: Neues Passwort bestätigen

source: Email confirmation
de: E-Mail bestätigen

source: Send
de: Absenden

source: Validating email confirmation link...
de: Bestätigungslink wird überprüft...

source: Information about certificates
de: Infos zu den Zertifikaten

source: How can I download certificates?
de: Wie kann ich Zertifikate herunterladen?

source: In this video you will learn how and where you can dowload the certificates for your pupils
de: Im Video erklären wir dir, wie und wo du Zertifikate für deine Schülerinnen und Schüler findest

source: Tips for the usage of the platform
de: Tipps zur Nutzung der Plattform

source: Are you new here or would you like to know how can you optimally work with the platform and the documents?
de: Du bist neu hier oder willst gerne wissen, wie du optimal mit unserer Plattform und den Unterlagen arbeiten kannst?

source: In the video, we introduce the platform and give some usage tips
de: In dem Video stellen wir die Plattform vor und geben Tipps zur Nutzung

source: Do you prefer to read? Here you can find the PDF
de: Du liest dir das lieber durch? Hier findest du ein PDF

source: please, click
de: bitte anklicken

source: Welcome to App Camps
de: Willkommen bei App Camps

source: It is crucial for us to know, where our materials are used. Before you can setup your classes, we need you to tell us a bit more about you.
de: Für uns ist es wichtig zu wissen, wo unsere Unterlagen eingesetzt werden. Bitte fülle daher dieses kurze Formular aus.

source: Invalid email or password
de: E-Mail oder Passwort ungültig

source: Your session has expired
de: Deine Sitzung ist abgelaufen

source: Unconfirmed email.
de: E-Mail-Adresse unbestätigt.

source: Did not sign up yet? {registrationLink}
de: Du bist neu hier? {registrationLink}

source: Register here
de: Hier geht’s zur Registrierung

source: Did not receive a confirmation email? {confirmationLink}
de: Keine Bestätigungsmail erhalten? {confirmationLink}

source: Click here
de: Hier klicken

source: Login
de: Anmelden

source: Forgot your password?
de: Passwort vergessen?

source: Password
de: Passwort

source: To the card
de: Zu den Karten

source: Here you go to the learning cards
de: So geht's zu den Lernkarten

source: Open the URL in the browser
de: URL in den Browser eingeben

source: Submit this code
de: Mit diesem Code freischalten

source: Password reset
de: Passwort zurücksetzen

source: Password confirmation
de: Passwort bestätigen

source: previous posts
de: vorherige Beiträge

source: next posts
de: weitere Beiträge

source: Released on {releaseDate}
de: Veröffentlicht am {releaseDate}

source: Soon we will provide interesting news from us and our partners here.
de: Bald findest du hier Neuigkeiten von uns und unseren Partnern.

source: How did you hear from us?
de: Wie hast du von uns erfahren?

source: Comment
de: Anmerkungen

source: By registrating I accept the following terms:
de: Mit deiner Registrierung stimmst du den folgenden Bedingungen zu:

source: I will not forward any data or teaching materials to third parties. My colleagues may register themselves on interest.
de: Ich gebe meine Anmeldedaten nicht an Dritte weiter. Meine Kollegen können sich bei Interesse ebenfalls registrieren.

source: I accept to receive our newsletter per email (e.g notifications about new teaching materials). You may revoke this any time by clicking the provided links in the email or by sending an email to {email}.
de: Ich stimme zu über Neuigkeiten per E-Mail informiert zu werden (z.B. Ankündigung neue Unterlagen). Die Zustimmung kann jederzeit per E-Mail an {email} widerrufen werden.

source: Data protection
de: Datenschutz

source: I have read and accept the {privacyPolicy} of App Camps.
de: Ich habe die {privacyPolicy} von App Camps gelesen und stimme zu.

source: Sign up free of charge
de: Jetzt kostenlos registrieren

source: student
de: Schüler

source: We are sorry, but this platform was built with teachers and course instructors in mind. Nonetheless we provide a newsletter for students like you, where we will keep you informed about programming, computer science and technology.
de: Unsere Plattform ist für Lehrkräfte und Kursleiter*innen gedacht. Für Schüler*innen haben bieten wir allerdings einen Newsletter an. Wir informieren über interessante Themen und Neuigkeiten rund um die Themen Programmieren, Informatik und Technologie.

source: parent
de: Eltern

source: We are sorry, but this platform was built with teachers and course instructors in mind. Nonetheless we provide a newsletter for parents, where we will keep you informed about programming, computer science and technology.
de: Unsere Plattform ist für Lehrkräfte und Kursleiter*innen gedacht. Für Eltern bieten wir allerdings einen Newsletter an. Wir informieren über interessante Themen und Neuigkeiten rund um die Themen Programmieren, Informatik und Technologie.

source: Teacher
de: Lehrer*in

source: Course instructor
de: Kursleiter*in

source: Parent
de: ein Elternteil

source: Student
de: Schüler*in

source: Please sign up for free access
de: Registriere dich, um kostenlos Zugang zu erhalten

source: Already registered? {signIn}
de: Bereits registriert? {signIn}

source: Sign in
de: Hier gehts zur Anmeldung

source: I am a
de: Ich bin

source: Thank you for you interest in App Camps
de: Danke für dein Interesse an App Camps

source: Registration success
de: Registrierung erfolgreich

source: Welcome to App Camps, {firstName}!
de: Herzlich willkommen bei App Camps, {firstName}!

source: You will soon receive an confirmation email. To complete your registration, please click on the confirmation link in the email. Afterwards you will be able to sign in.
de: Du wirst bald eine Bestätigungs-E-Mail erhalten. Klicke bitte auf den Link in der E-Mail um deine Registrierung abzuschließen. Danach kannst du dich einloggen.

source: If the email does not arrive within the next minutes please {resendConfirmationLink} it or {supportEmailLink}.
de: Falls die E-Mail nicht innerhalb der nächsten Minuten ankommt {resendConfirmationLink} oder {supportEmailLink}.

source: send us an email
de: melde dich bei uns

source: click here to resend
de: lass sie dir erneut zuschicken

source: In a lesson (duty)
de: Im regulären Unterricht (Pflichtbereich)

source: In a lesson (choice)
de: Im regulären Unterricht (Wahlbereich)

source: With a project group
de: In einer AG

source: On project days
de: Während der Projekttage

source: In which project group will you use the materials?
de: In welcher AG findet der Kurs statt?

source: In what kind of project will you use the materials?
de: Um was für ein Projekt handelt es sich?

source: In which school subject will you use the materials?
de: In welchem Fach findet der Kurs statt?

source: Add information about your class
de: Angaben zu diesem Klassenprofil

source: Class name
de: Name der Klasse

source: School year
de: Schuljahr

source: Grade
de: Klassenstufe

source: Girl count
de: Anzahl der Mädchen

source: Boy count
de: Anzahl der Jungen

source: Where will you use the materials?
de: Einsatzrahmen

source: Next
de: Weiter

source: Back
de: Zurück

source: No Courses found for topic {topic}
de: Für {topic} konnten keine Kurse gefunden werden

source: remove
de: entfernen

source: added
de: hinzugefügt

source: add
de: hinzufügen

source: Choose topics and courses for class
de: Auswahl von Themen und Kursen

source: Group name
de: Name der Gruppe

source: Year
de: Kalenderjahr

source: Age
de: Alter der Teilnehmer

source: In what setting will you teach the courses?
de: In welchem Rahmen findet der Kurs statt?

source: Where will the class take place
de: In welchem Rahmen findet der Kurs statt

source: School class
de: In der Schule

source: Extracurricular
de: Außerschulisch

source: Choose class type
de: Geplante Nutzung

source: Add class information
de: Informationen zur Klasse

source: Choose courses
de: Kursauswahl

source: Available when all lessons are completed.
de: Verfügbar sobald alle Lektionen als erledigt markiert wurden.

source: Click here to download your template.
de: Klicke hier um die Zertifikatvorlage herunterzuladen.

source: Click to get help
de: Klicke um zur Hilfe zu gelangen

source: Lesson content
de: Inhalte der Lektion

source: Common mistakes
de: Häufige Fehler

source: Lesson links & hints
de: Links & Hinweise zur Lektion

source: previous lesson
de: vorherige Lektion

source: next lesson
de: nächste Lektion

source: completed {completedLessons} of {totalLessons} lessons
de: {completedLessons} von {totalLessons} Lektionen erledigt

source: Enter school type
de: Schultyp eingeben…

source: School type
de: Schulart

source: School name
de: Schulname

source: Subjects
de: Fächer

source: Profession / professional background
de: Beruf bzw. beruflicher Hinterund

source: Enter country
de: Land eingeben...

source: Canton
de: Kanton

source: Federal state
de: Bundesland

source: State
de: Bundesstaat

source: District
de: Distrikt

source: Choose {entity}
de: {entity} auswählen

source: Country
de: Land

source: Postal code
de: Postleitzahl

source: City
de: Stadt

source: Clear all
de: Alle löschen

source: Clear
de: Löschen

source: Add label
de: Label hinzufügen

source: No results found
de: Keine Ergebnisse

source: Please select
de: Bitte auswählen

source: Type to search
de: Tippen um zu suchen

source: Add {label}
de: {label} auswählen

source: Preparation
de: Vorbereitung

source: Course offering
de: Kursangebot

source: There are no preparation materials for this topic.
de: Für dieses Thema sind keine Materialien zur Kursvorbereitung vorhanden.

source: Here are important informations and materials to prepare your lessons.
de: Hier findest du wichtige Informationen und Unterlagen zur Vorbereitung.

source: Elementary school
de: Grundschule

source: Main school
de: Hauptschule

source: Middle school
de: Realschule

source: Comprehensive school
de: Gesamtschule / Gemeinschaftschule / Stadtteilschule

source: Academic high school
de: Gymnasium

source: Vocational school
de: Berufliche Schule

source: University
de: Hochschule / Universität

source: Special school
de: Förderschule

source: Login successful. You will now be redirected...
de: Login erfolgreich. Sie werden jetzt weitergeleitet.

source: Too many requests. Please try again in a few seconds.
de: Zu viele Anfragen. Bitte versuchen sie es in ein paar Sekunden erneut.

source: There was an Error processing your request. Please contact philipp@appcamps.de if the problem persists.
de: Leider ist ein Fehler aufgetreten. Wende dich bitte an philipp@appcamps.de falls das Problem weiterhin besteht.

source: Required
de: Erforderlich

source: Invalid
de: Ungültig

source: Not an email
de: Keine E-Mail

source: Not equal
de: Nicht identisch

source: You need to confirm our privacy policy
de: Du musst die Datenschutzbedingungen bestätigen

source: At least 8 chars
de: Mindestens 8 Zeichen

source: has already been taken
de: Bereits vorhanden
